package part01.chapter03.section02;

public class ArithemticOperatorExplain {
    /**
     * 3.2 산술 연산자
     * 
     * 산술 연산자는 더하기(+), 빼기(-), 곱하기(*), 나누기(/), 나머지(%)로 총 5개이다. 
     * 
     * 피연산자 + 피연산자 -> 덧셈 연산
     * 피연산자 - 피연산자 -> 뺄셈 연산
     * 피연산자 * 피연산자 -> 곱셈 연산
     * 피연산자 / 피연산자 -> 나눗셈 연산
     * 피연산자 % 피연산자 -> 나눗셈의 나머지를 산출하는 연산
     * 
     * 곱셈의 경우 *를 사용하고 나눗셈의 경우 /를 사용한다는 것이 일반 수학과 다르다. 
     * % 연산자는 나눗셈을 수행한 후에 몫이 아닌 나머지를 산출하는 연산자이다.
     * 
     * int result = num % 3;
     * 
     * 설명
     * result = 0,1,2중 한값
     * num을 3으로 나눈 나머지를 result에 저장한다.
     * 
     * 산술 연산의 특징은 다음과 같다. 
     * 
     * 피연산자가 정수 타입(byte,short,char,int)이면 연산의 결과는 int 타입이다.
     * 피연산자가 정수 타입이고 그 중 하나가 long 타입이면 연산의 결과는 long 타입이다.
     * 피연산자 중 하나가 실수 타입이면 연산의 결과는 실수 타입이다. 
     * 
     * ArithmeticOperatorExample.java 참조
     */
}